# ===== STRINGS: BASIC =====
# Stepik 13.5: https://stepik.org/lesson/334314

"=== Задача 1: Середина отрезка"
# объявление функции
def get_middle_point(x1, y1, x2, y2):
    x_sol = (x1 + x2) / 2
    y_sol = (y1 + y2) / 2
    return x_sol, y_sol

# считываем данные
#x_1, y_1 = int(input()), int(input())
#x_2, y_2 = int(input()), int(input())

# вызываем функцию
#x, y = get_middle_point(x_1, y_1, x_2, y_2)
#print(x, y)


"=== Задача 2: Площадь и длина 📏"
from math import pi
def get_circle(radius):
    C = 2 * pi * r
    S = pi * r ** 2
    return C, S

# считываем данные
#r = float(input())


#length, square = get_circle(r)


"=== Задача 3: Корни уравнения 🌶️"
# объявление функции
def solve(a, b, c):
    D = (b**2) - (4 * a * c)    # Вычисляем дискриминант (D<0 - нет корней, D=0 - 1 корень, D>0 - 2корня)   
                                # по условию задачи гарантируется 1 корень. Если корень 1 выводим его 2 раза

    x = (-b - D ** 0.5) / (2 * a)       # формула действительного корня
    y = (-b + D ** 0.5) / (2 * a)       # формула действительного корня
    return min(x, y), max(x, y)
        
      

# считываем данные
a, b, c = int(input()), int(input()), int(input())
# вызываем функцию
x1, x2 = solve(a, b, c)
print(x1, x2)