# ===== STRINGS: BASIC =====
# Stepik 11.6: https://stepik.org/lesson/324754

print("=== Задача 1: Всё сразу 2 🌶️")
"""Дополните приведённый ниже код, чтобы он:
1 Заменил второй (по порядку) элемент списка на 17;
2 Добавил числа 4, 5 и 6 в конец списка;
3 Удалил первый (по порядку) элемент списка;
4 Удвоил список;
5 Вставил число 25 по индексу 3;
6 Вывел список с помощью функции print() """

numbers = [8, 9, 10, 11]
# 1. Заменил второй (по порядку) элемент списка на 17
numbers[1] = 17
# 2. Добавил числа 4, 5 и 6 в конец списка
numbers.extend([4, 5, 6])
# 3. Удалил первый (по порядку) элемент списка
del numbers[0]
# 4. Удвоил список
numbers *= 2
# 5. Вставил число 25 по индексу 3
numbers.insert(3, 25)
# 6. Вывел список с помощью функции print()
print(numbers)


print("=== Задача 2: Количество артиклей ")
text = input().lower().split()

cnt1 = text.count("a")
cnt2 = text.count("an")
cnt3 = text.count("the")
total_cnt = cnt1+cnt2+cnt3
print(f'Общее количество артиклей: {total_cnt}')


print("=== Задача 3: Переставить min и max 🌶️ ")
text = input().split()
temp = []
# 1. создаем список с целыми числами
for el in text:
    temp.append(int(el))

# 2. Находим значения макс и мин
max_el = max(temp)
min_el = min(temp)


# 3. находим индексы min и max
min_index = temp.index(min(temp))
max_index = temp.index(max(temp))

# 4. переставляем min и max местами
temp[min_index], temp[max_index] = temp[max_index], temp[min_index]

# 5. Выводим результат
result = ' '.join(str(num) for num in temp)
print(result)


print("=== Задача 4: Взлом Братства Стали 🌶️ ")
first = input()                         # 1. Читаем первую строку с '#n'
n = int(first.lstrip('#'))              # Убираем '#' слева

for _ in range(n):                      # 2. Читаем n строк кода
    line = input()

    hash_index = line.find('#')         # 3. Находим индекс #

    if hash_index != - 1:               # если != то # присутствует в коде
        line = line[: hash_index]       # обрезаем строку до #
    
    line = line.rstrip()                # Убираем пробелы в конце строки

print(line)


print("=== Задача 5: Сортировка чисел ")
line = input().split()

for i in range(len(line)):
    line[i] = int(line[i])

min_sort = line.sort()
print(*line)
max_sort = line.sort(reverse=True)
print(*line)


print("=== Задача 6: Сортируем песни 🎵 ")
n = int(input())
play_list = []
for _ in range(n):
    play_list.append(input())

play_list.sort()
print(*play_list, sep='\n')