#  ШАХМАТНАЯ ДОСКА
# На вход программе подаются четыре числа от 1 до 8 каждое,
# задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки
# Программа должна определять, имеют ли указанные клетки один цвет или нет. 
# Если они покрашены в один цвет, то выведите слово «YES», а если в разные цвета, то «NO».


x1 = int(input())
y1 = int(input())
x2 = int(input())
y2 = int(input())

color1 = 0
color2 = 0

# определим какого цвета первая заданная клетка

if (x1 % 2 != 0 and y1 % 2 != 0) or x1 % 2 == 0 and y1 % 2 == 0:
    color1 = "белый"
else:
    color1 = "черный"

# определим какого цвета вторая заданная клетка

if (x2 % 2 != 0 and y2 % 2 != 0) or x2 % 2 == 0 and y2 % 2 == 0:
    color2 = "белый"
else:
    color2 = "черный"

if color1 == color2:
    print('YES')
else:
    print("NO")
