# ===== STRINGS: BASIC =====
# Stepik 14.1 : https://stepik.org/lesson/334152

"=== Задача 1: Звёздный треугольник ⭐🌶️"

# объявление функции
def draw_triangle(height, base):
    for i in range(height):
        stars = 2 * i + 1       # Количество звезд в текущей строке: 2*i + 1

        spaces = (base - stars) // 2   # Количество пробелов с каждой стороны

        print(' ' * spaces + '*' * stars)

# основная программа
# draw_triangle(8, 15)  # вызов функции


"=== Задача 2: Калькулятор доставки 🛵"
# объявление функции
def get_shipping_cost(quantity):
    first_shipping = 1000
    next_shipping = 120
    return (first_shipping + next_shipping * (quantity - 1))

# считываем данные
#n = int(input())

# вызываем функцию
#print(get_shipping_cost(n))


"=== Задача 3: Биномиальный коэффициент 🌶️"
# вспомогательная функция вычисляет факториал
def get_factorial(num):
    factorial = 1
    for i in range(1, num + 1):
        factorial  *= i

    return factorial

# основная функция Биномиальный коэффициент
# объявление функции
def compute_binom(n, k):
    binom = get_factorial(n) / (get_factorial(k) * get_factorial(n - k))
    return int(binom)

# считываем данные
#n = int(input())
#k = int(input())

# вызываем функцию
#print(compute_binom(n, k))


"=== Задача 4: Число словами 🌶️"
# объявление функции
def number_to_words(num):
    units = ["один", "два", "три", "четыре", "пять", 
         "шесть", "семь", "восемь", "девять"]
    
    teens = ["одиннадцать", "двенадцать", "тринадцать", "четырнадцать", 
         "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", 
         "девятнадцать"]
    
    tens = ["десять", "двадцать", "тридцать", "сорок", "пятьдесят", 
        "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
    
    if 1 <= num <= 9:
        return units[num - 1] 
    elif 11 <= num <= 19:
        return teens[num - 11]
    else:
        tens_digit = num // 10              # находим десятки - 44 // 10 = 4 (сорок)
        ones_digit = num % 10               # находим десятки - 44 % 10 = 4 (четыре) 
        
        word =  tens[tens_digit - 1]        # word = сорок (уже есть)
    
        if ones_digit > 0:
            word += ' ' + units[ones_digit - 1]     # в данном случае добавляем к сорок (четыре)

        return word                                 # выводим результат


# считываем данные
#n = int(input())

# вызываем функцию
#print(number_to_words(n))


"=== Задача 5: Искомый месяц 📅"
# объявление функции
def get_month(language, number):
    russian_months = ['',
    "январь", "февраль", "март", "апрель", "май", "июнь",
    "июль", "август", "сентябрь", "октябрь", "ноябрь", "декабрь"]

    english_months = ['',
    "january", "february", "march", "april", "may", "june",
    "july", "august", "september", "october", "november", "december"]

    if language == 'ru':
        return russian_months[number]
    else:
        return english_months[number]


# считываем данные
#lan = input()
#num = int(input())

# вызываем функцию
#print(get_month(lan, num))


"=== Задача 6: Магические даты ✨"
# объявление функции
def is_magic(date):
    res = date.split('.')

    return int(res[0]) * int(res[1]) == (int(res[2]) % 100)
        

# считываем данные
#date = input()

# вызываем функцию
#print(is_magic(date))


"=== Задача 7: Панграммы 🌶️"
def is_pangram(text):
    alphabet = 'abcdefghijklmnopqrstuvwxyz'     # Алфавит как строка для быстрого поиска
    found = [False] * 26                        # Список для отслеживания найденных букв

    for char in text.lower():
        if char != ' ':                         # Пропускаем пробелы
            if char in alphabet:
                index = alphabet.index(char)    #Находим индекс буквы в алфавите
                found[index] = True

    return all(found)                           # Проверяем, все ли True в списке found


# считываем данные
#text = input()

# вызываем функцию
#print(is_pangram(text))

