#!/usr/bin/env python3
"""
МОДУЛЬ 3: Продвинутый Python
РАЗДЕЛ: 03_nested_lists_matrice
УРОК: 4.4 Матрицы часть 1
СТАТУС:  ⏳ 7/7 задач решено (22.01.2026)
СЛОЖНОСТЬ: ⭐⭐☆☆☆

Задачи из курса Stepik "Поколение Python: курс для продвинутых"
https://stepik.org/lesson/416754
"""

"""
Паттерн 1: Слова по одному
Ввод: слово1\nслово2\nслово3\n...
matrix = [[input() for j in range(m)] for i in range(n)]

Паттерн 2: Строки целиком
# Ввод: слово1 слово2\nслово3 слово4\n...
matrix = [input().split()[:m] for _ in range(n)]
"""

# функция для вывода квадратной матрицы размерности  n
def print_matrix(matrix, n, width=1):
     
    for r in range(n):
        for c in range(n):
            print(str(matrix[r][c]).ljust(width), end=' ')
        print()

# ===== ЗАДАЧА 1 Вывести матрицу 1=====
n = int(input())
m = int(input())

matrix = [[input() for j in range(m)] for i in range(n)]
for row in matrix:
    print(*row)

# ===== ЗАДАЧА 2 Вывести матрицу 2=====
n = int(input())
m = int(input())

matrix = [[input() for j in range(m)] for i in range(n)]
for row in matrix:
    print(*row)
print()
for j in range(m):
    column = [matrix[i][j] for i in range(n)]
    print(*column)

# ===== ЗАДАЧА 3 След матрицы ↘️=====
"""
Следом квадратной матрицы называется сумма элементов главной диагонали. Напишите программу, которая выводит след заданной квадратной матрицы.
На вход программе подается натуральное число n – количество строк и столбцов в матрице, затем элементы матрицы (целые числа) построчно через пробел.
"""
n = int(input())
total = 0
matrix = [list(map(int, input().split())) for _ in range(n)]
total = sum(matrix[i][i] for i in range(len(matrix)))
print(total)   

# решение в одну строку print(sum(list(map(int, input().split()))[i] for i in range(n)))

# ===== ЗАДАЧА 4 Больше стреднего=====
"""
Напишите программу, которая выводит количество элементов квадратной матрицы в каждой строке, больших среднего арифметического элементов данной строки.
Формат входных данных:
На вход программе подается натуральное число n – количество строк и столбцов в матрице, затем элементы матрицы (целые числа) построчно через пробел.
"""

n = int(input())
matrix = [list(map(int, input().split())) for _ in range(n)]

for row in matrix:
    cnt = 0
    # Вычисляем среднее для текущей строки
    average = sum(row) / len(row)
    
    # Сравниваем каждый элемент строки со средним
    for elem in row:
        if elem > average:
            cnt += 1
    
    print(cnt)

# ===== ЗАДАЧА 5 Максимальный в области 1=====
"""
Напишите программу, которая выводит максимальный элемент в заштрихованной области квадратной матрицы.
Формат входных данных
На вход программе подается натуральное число n – количество строк и столбцов в матрице, затем элементы матрицы (целые числа) построчно через пробел.
"""
n = int(input())
matrix = [list(map(int, input().split())) for _ in range(n)]

max_value = matrix[0][0]
for i in range(n):
    for j in range(i + 1):
        if matrix[i][j] > max_value:
            max_value = matrix[i][j]

print(max_value)

# 1 строкой
print(max(matrix[i][j] for i in range(n) for j in range(i + 1)))


# ===== ЗАДАЧА 6 Максимальный в области 2 🌶️ =====
"""
Напишите программу, которая выводит максимальный элемент в заштрихованной области квадратной матрицы.
Формат входных данных
На вход программе подается натуральное число n – количество строк и столбцов в матрице, затем элементы матрицы (целые числа) построчно через пробел.
"""
n = int(input())
matrix = [list(map(int, input().split())) for _ in range(n)]

max_left = matrix[0][0]      # Для левого треугольника
max_right = matrix[0][n-1]   # Для правого треугольника

for i in range(n):
    for j in range(n):
        # Левый треугольник
        if j <= i and i + j <= n - 1:
            if matrix[i][j] > max_left:
                max_left = matrix[i][j]
        
        # Правый треугольник  
        if j >= i and i + j >= n - 1:
            if matrix[i][j] > max_right:
                max_right = matrix[i][j]

# Общий максимум из двух треугольников
print(max(max_left, max_right))     

# Генераторы для обоих треугольников
max_left = max(matrix[i][j] for i in range(n) for j in range(i+1) if i+j <= n-1)
max_right = max(matrix[i][j] for i in range(n) for j in range(i, n) if i+j >= n-1)

print(max(max_left, max_right)) 


# ===== ЗАДАЧА 7 Суммы четвертей =====
"""
Квадратная матрица разбивается на четыре четверти, ограниченные главной и побочной диагоналями: верхнюю, нижнюю, левую и правую.
Напишите программу, которая вычисляет сумму элементов: верхней четверти; правой четверти; нижней четверти; левой четверти.
На вход программе подается натуральное число n – количество строк и столбцов в матрице, затем элементы матрицы (целые числа) построчно через пробел.
Примечание. Элементы диагоналей не учитываются.
"""

n= int(input())

matrix = [list(map(int, input().split())) for _ in range(n)]

upper_quater = sum(matrix[i][j] for i in range(n) for j in range(i + 1, n) if i + j < n -1)
print(f'Верхняя четверть: {upper_quater}')

right_quater = sum(matrix[i][j] for i in range(n) for j in range(i + 1, n) if i + j > n -1)
print(f'Правая четверть: {right_quater}')

lower_quater = sum(matrix[i][j] for i in range(n) for j in range(i) if i + j > n -1)
print(f'Нижняя четверть: {lower_quater}')

left_quater = sum(matrix[i][j] for i in range(n) for j in range(i) if i + j < n - 1)
print(f'Левая четверть: {left_quater}')



