# ===== STRINGS: BASIC =====
# Stepik 13.4: https://stepik.org/lesson/334150

"=== Задача 1: Is the Triangle Valid?"
# объявление функции
def is_valid_triangle(side1, side2, side3):
    if side1 + side2 > side3 and side1 + side3 > side2 and side2 + side3 > side1:
        return True
    else:
        return False

# считываем данные
#a, b, c = int(input()), int(input()), int(input())

# вызываем функцию
#print(is_valid_triangle(a, b, c))


"=== Задача 2: Палиндром"
# объявление функции
def is_palindrome(text):
    cleaned = "".join(char.lower() for char in text if char.isalnum())
    
    return cleaned == cleaned[::-1]

# считываем данные
txt = input()

# вызываем функцию
# print(is_palindrome(txt))


"=== Задача 3: Ровно в одном 1️⃣"
# объявление функции
def is_one_away(word1, word2):
    cnt1 = 0
    cnt2 = len(word1)
    if len(word1) == len(word2):                    # 1а) проверяем равные ли длины строк
        for i in range (len(word1)):                
            if word1[i] != word2[i]:                # 2) проверяем каждый символ в строке и счтиаем сколько совпадает и сколько нет
                cnt1 += 1
            else:
                cnt2 -= 1

        if cnt1 != 1 or cnt2 == 0:                  # 3) если кол-во совпадений равно длине, значит строки полностью равны
            return False                            # и значит False. Если различий больше 1 тоже False
        else:
            return True

    else:
        return False                                # 1б) False если не равны

# считываем данные
#txt1 = input()
#txt2 = input()

# вызываем функцию
#print(is_one_away(txt1, txt2))


"=== Задача 3: Ровно в одном 1️⃣ оптимизированный вариант"
# объявление функции
def is_one_away(word1, word2):
    cnt1 = 0
    
    if len(word1) == len(word2):                    # 1а) проверяем равные ли длины строк
        for i in range (len(word1)):                
            if word1[i] != word2[i]:                # 2) проверяем каждый символ в строке и счтиаем сколько совпадает и сколько нет
                cnt1 += 1
        
        return cnt1 == 1                            # 3) возвращает False если  !=1 или True если ==1

    return False                                     # 1б) False если не равны

# считываем данные
#txt1 = input()
#txt2 = input()

# вызываем функцию
#print(is_one_away(txt1, txt2))

"=== Задача 4: Змеиный регистр 🐍"
# объявление функции
def convert_to_python_case(text):
    snake_style = text[0].lower()

    for char in text[1:]:
        if char.isupper():
            snake_style += '_' + char.lower()
        else:
            snake_style += char

    return snake_style

# считываем данные
#txt = input()

# вызываем функцию
#print(convert_to_python_case(txt))


"=== Задача 5: Is the Number Prime? 🌶️"
# объявление функции
def is_prime(num):
    if num < 2:                         # быстрыми проверками исключаем 1 (оно не является простым)
        return False
    
    if num == 2:                        # быстрыми проверками идобавляем 2 (оно единственное четное и простое)
        return True
    
    if num % 2 == 0:                    # быстрыми исключаем все четные (они не являются простым)
        return False
    
    for i in range(3, int(num**0.5) + 1, 2):      # ускоряем проверку за счет проверки только нечетных до корня из num
        if num % i == 0:
            return False
                

    return True

# считываем данные
#n = int(input())

# вызываем функцию
#print(is_prime(n))


"=== Задача 6: Next Prime  🌶️"
def is_prime(num):
    if num < 2:                         # быстрыми проверками исключаем 1 (оно не является простым)
        return False
    
    if num == 2:                        # быстрыми проверками идобавляем 2 (оно единственное четное и простое)
        return True
    
    if num % 2 == 0:                    # быстрыми исключаем все четные (они не являются простым)
        return False
    
    for i in range(3, int(num**0.5) + 1, 2):      # ускоряем проверку за счет проверки только нечетных до корня из num
        if num % i == 0:
            return False
                

    return True

# Основная функция возвращает первое простое число, большее числа num.
def get_next_prime(num):
    candidate = num + 1              # Начинаем поиск со следующего числа

    while True:
        if is_prime(candidate):
            return candidate
        candidate += 1
               


# считываем данные
#n = int(input())

# вызываем функцию
#print(get_next_prime(n))


"=== Задача 7: Good password 🌶️"
def is_password_good(password):
    if len(password) < 8:
        return False
    
    has_upper = False
    has_lower = False  
    has_digit = False
    
    for char in password:
        if char.isupper():
            has_upper = True
        elif char.islower():
            has_lower = True
        elif char.isdigit():
            has_digit = True
    
    return has_upper and has_lower and has_digit

# считываем данные
#txt = input()

# вызываем функцию
#print(is_password_good(txt))


"=== Задача 8: Правильная скобочная последовательность 🌶️"
def is_correct_bracket(text):
    cnt = 0
    
    for char in text:             
        if char == '(':
            cnt += 1
        else:
            cnt -= 1
            if cnt < 0:
                return False

    return cnt == 0

# считываем данные
#txt = input()

# вызываем функцию
#print(is_correct_bracket(txt))

"=== Задача 9: BEEGEEK 🐝🌶️"
# Вспомогательная функция №1 проверка на палиндром
def is_palindrome(num):
    # Преобразуем число в строку
    str_num = str(num)
    # Проверяем как палиндром строки
    return str_num == str_num[::-1]


# Вспомогательная функция №2 проверка на простое число
def is_prime(num):
    if num < 2:                         # быстрыми проверками исключаем 1 (оно не является простым)
        return False
    
    if num == 2:                        # быстрыми проверками добавляем 2 (оно единственное четное и простое)
        return True
    
    if num % 2 == 0:                    # быстрыми проверками исключаем все четные (они не являются простым)
        return False
    
    for i in range(3, int(num**0.5) + 1, 2):      # ускоряем проверку за счет проверки только нечетных до корня из num
        if num % i == 0:
            return False
                

    return True


# Вспомогательная функция №3 проверка на четность
def is_even(num):
    return num % 2 == 0
    

# Основная функция проверка пароля 
def is_valid_password(password):
    parts = password.split(':')

    if len(parts) != 3:
        return False
    
    a, b, c = map(int, parts)

    return is_palindrome(a) and is_prime(b) and is_even(c)

# считываем данные
psw = input()

# вызываем функцию
print(is_valid_password(psw))