#!/usr/bin/env python3
"""
Проект 4: Шифр Цезаря

программа, способнаю шифровать и дешифровать текст в соответствии с алгоритмом Цезаря. 
Она должна запрашивать у пользователя следующие данные:
направление: шифрование или дешифрование;
язык алфавита: русский или английский;
шаг сдвига (со сдвигом вправо).
"""

rus_lower = "абвгдежзийклмнопрстуфхцчшщъыьэюя"
rus_upper = rus_lower.upper()
eng_lower = "abcdefghijklmnopqrstuvwxyz"
eng_upper = eng_lower.upper()

#1. функция кодировки для русского и английского алфавита
def text_encryption(text, key):
    # создаем новую строку для результата
    new_text = ''
    # идем по каждому символу в исходном тексте и сверяем к какой константе (rus_lower,..., eng_upper) он принадлежит
    for char in text:
        if char in rus_upper:
            new_index = (rus_upper.index(char) + key) % 32        # %32 обеспечивает цикличность(ё исключаем в данном случае) для цикличности
            new_text += rus_upper[new_index]
        elif char in rus_lower:
            new_index = (rus_lower.index(char) + key) % 32
            new_text += rus_lower[new_index]
        elif char in eng_upper:
            new_index = (eng_upper.index(char) + key) % 26        # %26 обеспечивает цикличность (z → a)
            new_text += eng_upper[new_index]
        elif char in eng_lower:
            new_index = (eng_lower.index(char) + key) % 26
            new_text += eng_lower[new_index]
        else:
            new_text += char
    return new_text
"""
# Вводим исходные данные текст дял шифрования и ключ            
text = input(f'Пожалуйста введите текст для кодировки на русском или английском:_ ')
key = int(input(f'Пожалуйста введите число - ключ:_'))
# Вывод результата
print(text_encryption(text, key))"""

#2. функция декодировки для русского и английского алфавита
def text_decoding(text, key):
    # создаем новую строку для результата
    old_text = ''
    for char in text:
        if char in rus_upper:
            new_index = (rus_upper.index(char) - key) % 32
            old_text += rus_upper[new_index]
        elif char in rus_lower:
            new_index = (rus_lower.index(char) - key) % 32
            old_text += rus_lower[new_index]
        elif char in eng_upper:
            new_index = (eng_upper.index(char) - key) % 26
            old_text += eng_upper[new_index]
        elif char in eng_lower:
            new_index = (eng_lower.index(char) - key) % 26
            old_text += eng_lower[new_index]
        else:
            old_text += char
    return old_text
            
"""# Вводим зашифрованный текст и ключ            
text = input(f'Пожалуйста введите зашифрованный текст:_ ')
key = int(input(f'Пожалуйста введите число - ключ:_'))
# Вывод результата
print(text_encryption(text, key))"""


#3. функция декодировки для английского алфавита если неизвестен ключ
def text_decoding_eng(text):
        
    for n in range(0, 26):
        # каждый раз создаем новую строку для резульатат       
        old_text = ''

        for char in text:
            if char in eng_upper:
                new_index = (eng_upper.index(char) - n) % 26
                old_text += eng_upper[new_index]
            elif char in eng_lower:
                new_index = (eng_lower.index(char) - n) % 26
                old_text += eng_lower[new_index]
            else:
                old_text += char

        print(n, old_text, end='\n')

# Вводим зашифрованный текст      
"""text = input()
# Вывод результата
print(text_decoding_eng(text))"""   # вывод будет содержать все варианты ключа


#3. функция декодировки для русского алфавита если неизвестен ключ(подбор)
def text_decoding_rus(text):
    
    
    for n in range(0, 33):
        # каждый раз создаем новую строку для резульатат       
        old_text = ''

        for char in text:
            if char in rus_upper:
                new_index = (rus_upper.index(char) - n) % 32
                old_text += rus_upper[new_index]
            elif char in rus_lower:
                new_index = (rus_lower.index(char) - n) % 32
                old_text += rus_lower[new_index]
            else:
                old_text += char

        print(n, old_text, end='\n')

# Вводим зашифрованный текст             
"""text = input()
# Вывод результата
print(text_decoding_rus(text))"""   # вывод будет содержать все варианты ключа


print("=== Задача: Аве, Цезарь 🌶️")
"""На вход программе подаётся строка текста на английском языке, в которой нужно зашифровать все слова. 
Каждое слово строки следует зашифровать с помощью шифра Цезаря (циклического сдвига на длину этого слова). 
Строчные буквы при этом остаются строчными, а прописные – прописными. Гарантируется, что между различными 
словами присутствует один пробел."""

def count_letters(word):
    """Вспомогательная функция: считает буквы в слове"""
    return sum(1 for char in word if char.isalpha())

def text_encryption_hard(text):
    #1. создаем новую строку для результата
    new_text = ''
    # преобразуем строку в список и разбиваем по пробелам с помощью split(' ')
    words = text.split(' ')
    # создаем список в котором будут ключи для шифрования каждого слова используем вспомогательную ф-ию def count_letters
    keys = [count_letters(word) for word in words]

    #2. идем по каждому слову и для каждого слова применяем соответствующий ключ из keys
    for i in range(len(words)):                  # words[i] - отдельное слово в списке, i - индекс этого слова

        for char in words[i]:                       # char - индекс символа в слове words[i]
            if char in eng_upper:         
                # keys[i] вставляем соответствующий ключ
                new_index = (eng_upper.index(char) + keys[i]) % 26        
                new_text += eng_upper[new_index]
            elif char in eng_lower:         
                # %26 обеспечивает цикличность (z → a)
                new_index = (eng_lower.index(char) + keys[i]) % 26        
                new_text += eng_lower[new_index]
            else:
                new_text += char
        # после каждого слова добавляем пробел
        new_text += ' '

    return new_text.rstrip()

# вводим исходную строку, которую нужно зашифровать
text = input()
# Вывод результата
print(text_encryption_hard(text))


